---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.ElementsNeedToBeDisconnected
source: html/6595ee76-205d-1bce-4d5e-1ff2b272e742.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.ElementsNeedToBeDisconnected Property

Elements need to be disconnected.

## Syntax (C#)
```csharp
public static FailureDefinitionId ElementsNeedToBeDisconnected { get; }
```